from src.services.text_analyzer import TextAnalyzer

import spacy

from src.services.text_entity_extractor import TextEntityExtractor

nlp = spacy.load("uk_core_news_lg")

text_entity_extractor = TextEntityExtractor()

text = """
Ведуча також назвала ще одного улюбленого співака.Українська ведуча Маша Єфросиніна побувала на масштабному концерті Klavdia Petrivna, де зірка вперше показала своє обличчя без окулярів і капелюхів.Порозважатися на подію разом з ведучою прийшов її син Олександр і друзі. Зокрема, Маша зробила декілька фото з хлопчиком і показала, як танцює під улюблені хіти загадкової співачки. Водночас Єфросиніна розкрила, що її ще одним улюбленим артистом є Артем Пивоваров і назвала його "своїм крашем".Загалом, родина насолоджувалася моментом наодинці недовго. Так, веселощі сина Єфросиніної закінчилися тоді, коли вони вийшли з концертної зали у коридор. Як виявилося, на знаменитість вже чатували фанати з проханням пофотографуватися, а вона, своєю чергою, їм не відмовила. Тож, 10-річному Сашкові довелося чекати не одну хвилину, щоб маму відпустили з ним на вечерю."Тут я прошу Олександра сфотографуватися з ним на пам'ять і обіцяю, що одразу біжимо їсти! Але син мені не повірив, бо щось знав…", - розповіла знаменитість.Нагадаємо, раніше редакція сайту ТСН.ua розкрила, який відомий співак допоміг Klavdia Petrivna стати популярною та хто стоїть за образом загадкової виконавиці.
"""

topic_keywords = {'маша єфросиніна', 'ЗСУ', 'війна', 'Румунія', 'Ігор Клименко', 'новини Львова', 'олена мозгова', 'журналісти', 'іран', 'новини Чернігова', 'паспорт', 'поліція', 'настя каменських', 'селидове', 'ракета', 'НАТО', 'вибух', 'окупація', 'ядерна зброя', 'ветерани', 'нікополь', 'загибель', 'донецька область', 'новини харкова', 'розстріл', 'донбас', 'Ту-22МЗ', 'ракетний удар', 'стрес', 'мобілізація', 'Patriot', 'пенсіонери', 'вибухи', 'володимир зеленський', 'Суми', 'Дмитро Лубінець', 'ссо', 'Краматорськ', 'єнс столтенберг', 'психотерапевт', 'воєнні злочини', 'новини Київської області', 'надя дорофєєва', 'Дніпро', 'Бурятія', 'новини донеччини', 'оточення', 'фронт', 'дрони', 'новини Одещини', 'новини дніпропетровської області', 'росіяни', 'дніпропетровська область', 'успіхи', 'втрати', 'Покровськ', 'Рамштайн', 'житло', 'Часів Яр', 'лікарня', 'новини сумської області', 'сирський', 'новини Кривого Рогу', 'Михайло Подоляк', 'Полтавська область', 'фсб', 'полтава', 'новини Києва', 'страта', 'сумська область', 'ллойд остін', 'паляниця', 'новини Дніпра', 'Alyona Alyona', 'курахове', 'авіаудар', 'інститут', 'україна', 'Валерій Залужний', 'ППО', 'росія', 'Сергій Рахманін', 'злата огнєвіч', 'жорін', 'олександр коваленко', 'постраждалі', 'новини сумщини', 'тимчасово окуповані території', 'тверська область', 'Путін', 'харківська область', 'бомба', 'військовий', 'зерновоз', 'фехтування', 'Курськ', 'загиблі', 'Вугледар', 'новини дніпропетровщини', 'Генштаб', 'безпілотник', 'полонені', 'Херсонська область', 'верховна рада', 'винищувач', 'польща', 'евакуація', 'Донеччина', 'деокупація', 'арешт', 'коваленко', 'CNN', 'Олег Синєгубов', 'новини запоріжжя', 'бронювання', 'командир', 'тривога', 'мзс', 'електростанція', 'уряд', 'пожежа', 'харківщина', 'літак', 'лікарі', 'сша', 'обстріл', 'чернігів', 'Херсон', 'окупанти', 'Селідове', 'харків', 'ірина сопонару', 'олег жданов', 'контрнаступ', 'андрій бєдняков'}

text_analyzer = TextAnalyzer()
text_analyzer.analyze_text(text, topic_keywords)


