from transformers import pipeline

summarizer = pipeline("summarization", model="yelyah/mT5-XLSUM-ua-news")
article = """
Запрошення до НАТО та фактичне приєднання до Альянсу можуть бути розірвані у часі.
Україну можуть запросити до НАТО ще до завершення президентського терміну Джо Байдена та до інавгурації наступного лідера США Дональда Трампа. Такий крок буде суто політичним рішенням.
Таку думку висловив голова постійної делегації Верховної Ради в Парламентській асамблеї НАТО, народний депутат з фракції "Слуга народу" Єгор Чернєв в ефірі національного телемарафону "Єдині новини" ввечері середи, 6 листопада.
"Запрошення, яке буде точно незворотнім шляхом України до НАТО, може бути надано в ці два місяці. Знову ж таки, виходячи з того, що Байдену вже нема чого втрачати, нема чим ризикувати. Вибори відбулися, він іде на пенсію. І йти з якимись досягненнями, мабуть, краще, ніж без нічого", – припустив Чернєв.
Він зауважив, що запрошення до НАТО ще не означає негайного вступу до Альянсу, і може пройти певний час, перш ніж Україна стане членом НАТО.
"Ми розуміємо, що на сьогодні ми абсолютно чітко можемо отримати запрошення України до НАТО. І ми розуміємо, що членство України в НАТО може відбутися після війни, і має відбутися, я думаю, після війни", – зазначив Єгор Чернєв.
"""
summary = summarizer(article)
print(summary)